app/controllers/charges_controller.rb

SELECT "charges".* FROM "charges" WHERE "charges"."paid" = $1 AND "charges"."refunded" = $2  [["paid", true], ["refunded", false]]
---
  def index
    @success_charges = Charge.where(paid: true , refunded: false)

INSERT INTO "charges" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-07-15 04:09:44.818218"], ["updated_at", "2020-07-15 04:09:44.818218"]]
---
  def create
    @charge = Charge.new(charge_params)

    respond_to do |format|
      if @charge.save

SELECT "charges".* FROM "charges" WHERE "charges"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_charge
      @charge = Charge.find(params[:id])