app/views/charges/index.html.erb

        <td><%= charge.refunded %></td>
        <td><%= charge.customer.first_name+ " " + charge.customer.last_name %></td>
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

        <td><%= charge.refunded %></td>
        <td><%= charge.customer.first_name+ " " + charge.customer.last_name %></td>
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

        <td><%= charge.refunded %></td>
        <td><%= charge.customer.first_name + " " + charge.customer.last_name %></td>
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]